Reports/КСУ_РасходыПоПодразделениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>КСУ_РасходыПоПодразделениям</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ИА_ИсторияСтатусовЗВС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ИсторияСтатусовЗВС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_СостояниеЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗВС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаявкаНаОбязательства</v8:Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ИА_СредстваВРезервеНаФондах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_СредстваВРезервеНаФондах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ИА_СостояниеЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_СостояниеЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденРуководителем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненРуководителем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассмотретьНаФП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_НетВыплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_ЧастичныеВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_ВсёВыплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_НетВыплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_ЧастичныеВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_ВсёВыплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносНаСледующееФП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Comment>Организации</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификационныйНомерПлательщикаЕвропейскогоНДС</Name>
					<Comment>VAT Number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяНастройкаИнтеркампани</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиИнтеркампани</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСистемНалогообложенияККТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДСПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОсновнаяЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОсновнойСайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОсновнойТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЛоготип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлПечать</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлПодписьГлавногоБухгалтера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлПодписьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяПлательщикомНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/КСУ_РасходыПоПодразделениям/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьНастройки()
	НаДату = ТекущаяДата();
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Показывать сводные";
	НовстрН.Выбрать = истина;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Показывать детализацию";
	НовстрН.Выбрать = истина;

	
	//
	МассОрг = ИА_ФПСервер.ПолучитьОрганизацииДляОтчетов();
	Для каждого орг из МассОрг Цикл
		НовстрН = Организации.Добавить();
		НовстрН.Организация = орг;
		НовстрН.Выбрать = истина;
	КонецЦикла;
	Если не Константы.ИА_ФП_ВестиФППоОрганизациям.Получить() Тогда
		НовстрН = Организации.Добавить();
		НовстрН.Организация = Справочники.Организации.ПустаяСсылка();
		НовстрН.Выбрать = истина;
	КонецЕсли;
	
	//
	Выборка= Справочники.ИА_ЦФО.Выбрать(,,,"Наименование");
	Пока выборка.Следующий() Цикл
		Если не выборка.ПометкаУдаления Тогда
			НовстрН = Подразделения.Добавить();
			НовстрН.Подразделение = выборка.Ссылка;
			НовстрН.Выбрать = истина;		
		КонецЕсли;
	КонецЦикла;
	НовстрН = Подразделения.Добавить();
	НовстрН.Подразделение = Справочники.ИА_ЦФО.ПустаяСсылка();
	НовстрН.Выбрать = истина;		
	
	//
	ЭтоРСФ = ИА_ФП.ЭтоРСФ();
	Выборка= Справочники.ИА_Фонды.Выбрать(,,,"Наименование");
	Пока выборка.Следующий() Цикл
		Если не выборка.ПометкаУдаления Тогда
			Если ЭтоРСФ или выборка.Защищенный = ложь Тогда
				НовстрН = Фонды.Добавить();
				НовстрН.Фонд = Выборка.Ссылка;
				НовстрН.Выбрать = истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//
	Выборка= Справочники.КСУ_СтатьиРасходов.Выбрать(,,,"Наименование");
	Пока выборка.Следующий() Цикл
		Если не выборка.ПометкаУдаления Тогда
			НовстрН = Статьи.Добавить();
			НовстрН.Статья = Выборка.Ссылка;
			НовстрН.Выбрать = истина;
		КонецЕсли;
	КонецЦикла;
	НовстрН = Статьи.Добавить();
	НовстрН.Статья = Справочники.КСУ_СтатьиРасходов.ПустаяСсылка();
	НовстрН.Выбрать = истина;		

КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ТабДок.Очистить();
	
	отч = РеквизитФормыВЗначение("Отчет");
	макет = отч.ПолучитьМакет("Макет");
	
	Обл = макет.ПолучитьОбласть("Шапка");
	ТекДата = ТекущаяДата();
	обл.параметры.ДатаОтчета = ТекДата;
	обл.параметры.Период = формат(ДатаНачала,"ДФ=dd.MM.yyyy") + " - " + формат(ДатаКонца,"ДФ=dd.MM.yyyy");
	ТабДок.Вывести(обл);
	
	ЕстьФильтры = ложь;
	ВыбФонды = Новый массив;
	Для каждого стр из Фонды Цикл
		Если стр.выбрать Тогда
			ВыбФонды.Добавить(стр.фонд);
		Иначе
			ЕстьФильтры = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ВыбПодр = Новый массив;
	Для каждого стр из Подразделения Цикл
		Если стр.выбрать Тогда
			ВыбПодр.Добавить(стр.Подразделение);
		Иначе
			ЕстьФильтры = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ВыбОрг = Новый массив;
	Для каждого стр из Организации Цикл
		Если стр.выбрать Тогда
			ВыбОрг.Добавить(стр.Организация);
		Иначе
			ЕстьФильтры = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ВыбСтатьи = Новый массив;
	Для каждого стр из статьи Цикл
		Если стр.выбрать Тогда
			ВыбСтатьи.Добавить(стр.Статья);
		Иначе
			ЕстьФильтры = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ЧтоТоВыбрано = ложь;
	Для сч =1 по Настройки.Количество() - 1 Цикл
		если Настройки[сч].Выбрать Тогда
			ЧтоТоВыбрано = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	////////////////////////////////////////////////////////
	
	Если ЕстьФильтры Тогда
		Обл = макет.ПолучитьОбласть("Фильтры");		
		ТабДок.Вывести(обл);
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////////////	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня(ДатаКонца));
	Запрос.УстановитьПараметр("Фонды", ВыбФонды);
	Запрос.УстановитьПараметр("Подразделения", ВыбПодр);
	Запрос.УстановитьПараметр("Организации", ВыбОрг);
	Запрос.УстановитьПараметр("Статьи", ВыбСтатьи);
	Запрос.УстановитьПараметр("СтатусРассмотретьНаФП", Перечисления.ИА_СостояниеЗаказа.РассмотретьНаФП);
	Запрос.УстановитьПараметр("СтатусНаСледФП", Перечисления.ИА_СостояниеЗаказа.ПереносНаСледующееФП);
	Запрос.УстановитьПараметр("СтатусОТклонен", Перечисления.ИА_СостояниеЗаказа.Отклонен);
	
	// подготовка данных
	Запрос.Текст = "ВЫБРАТЬ
	               |	Подзапрос.Заказ КАК Заказ,
	               |	Подзапрос.Заказ.Сумма КАК СуммаЗаказа,
	               |	СУММА(Подзапрос.Допущено) КАК Допущено,
	               |	СУММА(Подзапрос.Отклонено) КАК Отклонено,
	               |	СУММА(Подзапрос.Одобрено) КАК Одобрено,
	               |	СУММА(Подзапрос.Оплачено) КАК Оплачено,
	               |	Подзапрос.Заказ.Фонд КАК Фонд,
	               |	Подзапрос.Заказ.Подразделение КАК Подразделение,
	               |	Подзапрос.Заказ.Статья КАК Статья,
	               |	Подзапрос.Заказ.Номер КАК Номер,
	               |	Подзапрос.Заказ.ПредметЗаказа КАК Предмет,
	               |	Подзапрос.Заказ.Организация КАК Организация
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ИА_ИсторияСтатусовЗВС.ЗВС КАК Заказ,
	               |		ИА_ИсторияСтатусовЗВС.ЗВС.Сумма КАК Допущено,
	               |		0 КАК Отклонено,
	               |		0 КАК Одобрено,
	               |		0 КАК Оплачено
	               |	ИЗ
	               |		РегистрСведений.ИА_ИсторияСтатусовЗВС КАК ИА_ИсторияСтатусовЗВС
	               |	ГДЕ
	               |		ИА_ИсторияСтатусовЗВС.Статус = &СтатусРассмотретьНаФП
	               |		И ИА_ИсторияСтатусовЗВС.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ИА_ИсторияСтатусовЗВС.ЗВС,
	               |		0,
	               |		ИА_ИсторияСтатусовЗВС.ЗВС.Сумма,
	               |		0,
	               |		0
	               |	ИЗ
	               |		РегистрСведений.ИА_ИсторияСтатусовЗВС КАК ИА_ИсторияСтатусовЗВС
	               |	ГДЕ
	               |		ИА_ИсторияСтатусовЗВС.Статус = &СтатусОТклонен
	               |		И ИА_ИсторияСтатусовЗВС.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ИА_СредстваВРезервеНаФондахОбороты.ЗП,
	               |		0,
	               |		0,
	               |		ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналПриход,
	               |		ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналРасход
	               |	ИЗ
	               |		РегистрНакопления.ИА_СредстваВРезервеНаФондах.Обороты(&ДатаНАчала, &ДатаКонца, , ) КАК ИА_СредстваВРезервеНаФондахОбороты) КАК Подзапрос
	               |ГДЕ
	               |	Подзапрос.Заказ.Организация В(&Организации)
	               |	И Подзапрос.Заказ.Фонд В(&Фонды)
	               |	И Подзапрос.Заказ.Подразделение В(&Подразделения)
	               |	И Подзапрос.Заказ.Статья В(&Статьи)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Подзапрос.Заказ,
	               |	Подзапрос.Заказ.Сумма,
	               |	Подзапрос.Заказ.Фонд,
	               |	Подзапрос.Заказ.Подразделение,
	               |	Подзапрос.Заказ.Статья,
	               |	Подзапрос.Заказ.Номер,
	               |	Подзапрос.Заказ.ПредметЗаказа,
	               |	Подзапрос.Заказ.Организация
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Подзапрос.Заказ.Подразделение.Наименование,
	               |	Подзапрос.Заказ.Фонд.Наименование";
	ВсеДанные = запрос.Выполнить().Выгрузить();
	
	
	Если ЧтоТоВыбрано Тогда
		
		для каждого текОрг из ВыбОрг Цикл
			// организация
			Обл = макет.ПолучитьОбласть("ГруппаОрганизация");
			обл.параметры.Организация = текОрг;
			ТабДок.Вывести(обл);

			// фильтр данных по тек организации
			ТекДанные = ВсеДанные.Скопировать();
			Сч = ТекДанные.Количество() - 1;
			Пока сч >=0 Цикл
				если ТекДанные[сч].Организация <> текОрг Тогда
					ТекДанные.Удалить(сч);
				КонецЕсли;				
				сч = сч - 1;
			КонецЦикла;
			
			//
			Если Настройки[0].Выбрать Тогда // Сводно 
				ВывестиСводнуюТаблицу(макет, табдок, ТекДанные);
			КонецЕсли;	
			
			//
			Если Настройки[1].Выбрать Тогда // Детализация
				ВывестиДетализацию(макет, табдок, ТекДанные, ДатаНачала, КонецДня(ДатаКонца));
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;	
		
	Обл = макет.ПолучитьОбласть("Подвал");
	ТабДок.Вывести(обл);
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	
	Элементы.ТабДок.РежимМасштабированияПросмотра = РежимМасштабированияПросмотра.Обычный;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиДетализацию(макет, табдок, тз, ДатаНачала, ДатаКонца)

	Обл = макет.ПолучитьОбласть("ДетализацияШапка");
	ТабДок.Вывести(обл);
	
	тзДетал = тз.Скопировать();
	тзДетал.Свернуть("Подразделение", "СуммаЗаказа, Допущено, Отклонено, Одобрено, Оплачено");
	
	Для каждого стрДет из тзДетал Цикл	
		Обл = макет.ПолучитьОбласть("ДетализацияШапкаГруппировка");		
		обл.параметры.Группировка = стрДет.Подразделение; 
		ТабДок.Вывести(обл);
		
		
		// фильтр данных по тек Подразделению
		тзДетал1 = тз.Скопировать();
		Сч = тзДетал1.Количество() - 1;
		Пока сч >=0 Цикл
			если тзДетал1[сч].Подразделение <> стрДет.Подразделение Тогда
				тзДетал1.Удалить(сч);
			КонецЕсли;				
			сч = сч - 1;
		КонецЦикла;
		
		Для каждого стрЗаказ из тзДетал1 цикл
			Обл = макет.ПолучитьОбласть("ДетализацияСтрока");
			ЗаполнитьЗначенияСвойств(обл.параметры, стрЗаказ); 
			РегистраторыСтрукт = ПолучитьПредставлениеРегистраторов(стрЗаказ.Заказ, ДатаНачала, ДатаКонца);
			ЗаполнитьЗначенияСвойств(обл.параметры, РегистраторыСтрукт);
			ТабДок.Вывести(обл);
		КонецЦикла;
		
		Обл = макет.ПолучитьОбласть("ДетализацияИтого");
		обл.параметры.СуммаЗаказа = тзДетал1.итог("СуммаЗаказа");
		обл.параметры.Допущено = тзДетал1.итог("Допущено");
		обл.параметры.Отклонено = тзДетал1.итог("Отклонено");
		обл.параметры.Одобрено = тзДетал1.итог("Одобрено");
		обл.параметры.Оплачено = тзДетал1.итог("Оплачено");
		
		ТабДок.Вывести(обл);

	КонецЦикла;
	
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеРегистраторов(заказ, ДатаНачала, ДатаКонца)
	
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	ИА_СредстваВРезервеНаФондахОбороты.Регистратор КАК Регистратор,
	               |	ИА_СредстваВРезервеНаФондахОбороты.Регистратор.Номер КАК Номер,
	               |	ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналПриход КАК СуммаБезналПриход,
	               |	ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналРасход КАК СуммаБезналРасход
	               |ИЗ
	               |	РегистрНакопления.ИА_СредстваВРезервеНаФондах.Обороты(&ДатаНачала, &ДатаКонца, Регистратор, ЗП = &ЗП) КАК ИА_СредстваВРезервеНаФондахОбороты
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_СредстваВРезервеНаФондахОбороты.Период";
	Запрос.УстановитьПараметр("ЗП", заказ);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца", ДатаКонца);
	Выборка = запрос.Выполнить().Выбрать();
	
	рез = "";
	масс = новый массив;
	Пока выборка.Следующий() цикл
		Если рез <> "" Тогда
			рез = рез + ", ";
		КонецЕсли;
		ном = УбратьНули(выборка.Номер);
		
		Предст = "";
		Если ТипЗнч(Выборка.Регистратор) = тип("ДокументСсылка.ИА_ФинансовоеПланирование") Тогда
			Предст = "ФП №"+ном;
		ИначеЕсли ТипЗнч(Выборка.Регистратор) = тип("ДокументСсылка.КСУ_ВнедоходноеПоступлениеСредств") Тогда
			Предст = "ВДПС №"+ном;
		ИначеЕсли ТипЗнч(Выборка.Регистратор) = тип("ДокументСсылка.КСУ_ФормальнаяВыплата") Тогда
			Предст = "Форм. выплата №"+ном;
		ИначеЕсли ТипЗнч(Выборка.Регистратор) = тип("ДокументСсылка.ИА_ЗакрытиеЗаказаНаПриобретение") Тогда
			Предст = "Закрытие №"+ном;
		ИначеЕсли Выборка.СуммаБезналПриход > 0 Тогда
			Предст = "Возврат №"+ном;
		Иначе
			Предст = "Выплата №"+ном;
		КонецЕсли;
		
		рез = рез + Предст;
		масс.Добавить(Выборка.Регистратор);
	КонецЦикла;
	
	РезСтрукт = Новый Структура("Регистраторы, РегистраторыМассив", рез, масс); 
	
	возврат РезСтрукт;
КонецФункции

&НаСервереБезКонтекста
Функция УбратьНули(номер)
	рез = номер; 
	Пока Лев(рез, 1) = "0" Цикл 
	    рез = Прав(рез, СтрДлина(рез) - 1);
	КонецЦикла;
	Возврат рез;
КонецФункции

&НаСервереБезКонтекста
Процедура ВывестиСводнуюТаблицу(макет, табдок, тз)

	Обл = макет.ПолучитьОбласть("СводноШапка");
	ТабДок.Вывести(обл);
				   
	тзДетал = тз.Скопировать();
	тзДетал.Свернуть("Подразделение", "СуммаЗаказа, Допущено, Отклонено, Одобрено, Оплачено");
	
	Для каждого стрДет из тзДетал Цикл	
		
		Обл = макет.ПолучитьОбласть("СводноСтрока");		
		ЗаполнитьЗначенияСвойств(обл.параметры, стрДет); 
		ТабДок.Вывести(обл);
		
	КонецЦикла;
	
	Обл = макет.ПолучитьОбласть("СводноИтого");

	обл.параметры.Допущено = тзДетал.итог("Допущено");
	обл.параметры.Отклонено = тзДетал.итог("Отклонено");
	обл.параметры.Одобрено = тзДетал.итог("Одобрено");
	обл.параметры.Оплачено = тзДетал.итог("Оплачено");
	
	ТабДок.Вывести(обл);
	
КонецПроцедуры

///////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)	
	СформироватьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьСкрытьФильтры(Команда)
	Элементы.ГруппаПравая.Видимость = не Элементы.ГруппаПравая.Видимость;
	Элементы.ПоказатьСкрытьФильтры.Заголовок = ?(Элементы.ГруппаПравая.Видимость, "Скрыть фильтры", "Показать фильтры")
КонецПроцедуры

&НаКлиенте
Процедура НастройкиВыбратьПриИзменении(Элемент)
	Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Настройки Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);	
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Настройки1ВыбратьПриИзменении(Элемент)
	Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Организации Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);	
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ФондыВыбратьПриИзменении(Элемент)
	Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Фонды Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияВыбратьПриИзменении(Элемент)
	Элементы.ГруппаПодразделения.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Подразделения Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаПодразделения.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеНастройки(Команда)
	Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Настройки Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыборСоВсехНастроек(Команда)
	Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из Настройки Цикл
		стр.выбрать = ложь;
	КонецЦикла;
	
	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеОрганизации(Команда)
	Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Организации Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыборСоВсехОрганизаций(Команда)
	Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из Организации Цикл
		стр.выбрать = ложь;
	КонецЦикла;

	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеФонды(Команда)
	Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Фонды Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыборСоВсехФондов(Команда)
	Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из Фонды Цикл
		стр.выбрать = ложь;
	КонецЦикла;
	
	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеПодразделения(Команда)
	Элементы.ГруппаПодразделения.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Подразделения Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыбоСоВсехПодразделений(Команда)
	Элементы.ГруппаПодразделения.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из Подразделения Цикл
		стр.выбрать = ложь;
	КонецЦикла;
	
	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры

&НаКлиенте
Процедура СброситьФильтры(Команда)
	ВыбратьВсеНастройки(Неопределено);
	ВыбратьВсеОрганизации(Неопределено);
	ВыбратьВсеФонды(Неопределено);
	ВыбратьВсеПодразделения(Неопределено);
	
	Элементы.СброситьФильтры.Видимость = ложь;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьВсеГруппы(Команда)
	Элементы.ГруппаОрганизации.Скрыть();
	Элементы.ГруппаФонды.Скрыть();
	Элементы.ГруппаНастройки.Скрыть();
	Элементы.ГруппаПодразделения.Скрыть();
	Элементы.ГруппаСтатьи.Скрыть();
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсеГруппы(Команда)
	Элементы.ГруппаОрганизации.Показать();
	Элементы.ГруппаФонды.Показать();
	Элементы.ГруппаНастройки.Показать();
	Элементы.ГруппаПодразделения.Показать();
	Элементы.ГруппаСтатьи.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	если ТипЗнч(Расшифровка) = тип("Массив") Тогда
		СтандартнаяОбработка = ложь;
		
		сп = Новый СписокЗначений;
		сп.ЗагрузитьЗначения(Расшифровка);
		
		ОпОп = новый ОписаниеОповещения("ВыборРег", ЭтотОбъект);
		ПоказатьВыборИзСписка(ОпОп, сп);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыборРег(ВыбЗн, дп) Экспорт
	если ВыбЗн<>Неопределено Тогда
		ПоказатьЗначение(, ВыбЗн.Значение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтатьиВыбратьПриИзменении(Элемент)
	Элементы.ГруппаСтатьи.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Статьи Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаСтатьи.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеСтатьи(Команда)
	Элементы.ГруппаСтатьи.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Статьи Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыборСоВсехСтатей(Команда)
	Элементы.ГруппаСтатьи.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из статьи Цикл
		стр.выбрать = ложь;
	КонецЦикла;

	Элементы.СброситьФильтры.Видимость = истина;

КонецПроцедуры

&НаКлиенте
Процедура pdf(Команда)
	Оповещение  = Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтаФорма);
    ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение); 
	ДиалогВыбора.ПолноеИмяФайла = "Расходы по подразделениям "+ формат(ДатаНачала, "ДФ=dd.MM.yyyy") +"-" + формат(ДатаКонца, "ДФ=dd.MM.yyyy");
	ДиалогВыбора.Расширение = "pdf";
    ДиалогВыбора.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораЗавершение(МассивФайлов, ДопПараметры) Экспорт
    Если МассивФайлов = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	ТабДок.Записать(МассивФайлов[0], ТипФайлаТабличногоДокумента.PDF);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаКонца = ТекущаяДата();
	ДатаНачала = ДатаКонца - 60*60*24 * 7;
КонецПроцедуры
